[
  "Every moment with you feels like a beautiful dream I never want to wake up from.",
  "You make ordinary days feel extraordinary just by being in them.",
  "I fall for you a little more every single day, and honestly it's getting ridiculous how much I love you.",
  "The way you laugh makes my whole world brighter.",
  "You're my favorite notification, my favorite hello, and my hardest goodbye.",
  "I didn't know what I was missing until you walked into my life.",
  "With you, even silence feels like the best conversation.",
  "You're the reason I look forward to tomorrow.",
  "My heart does this little skip thing every time I see your name pop up.",
  "If loving you is a full-time job, I never want a day off.",
  "You're the kind of beautiful that makes me forget what I was going to say.",
  "I love how you make even the most boring errands feel like an adventure.",
  "Thinking about you is my brain's favorite hobby.",
  "You have this magical ability to make everything okay just by being near.",
  "I wrote you a poem but then I realized no words are good enough. So here's my heart instead.",
  "The best part of my day is any part that includes you.",
  "You make me want to be a better person, but also you make me want to stay in bed and cuddle all day.",
  "I love the way your eyes light up when you talk about things you care about.",
  "Being with you feels like coming home after the longest day.",
  "You're my 3am thought and my good morning smile.",
  "I still get butterflies when I see you, and I hope that never stops.",
  "You know that warm, fuzzy feeling? That's what you give me every single day.",
  "I'd choose you in every lifetime, in every universe, without hesitation.",
  "Your smile could end wars and start revolutions. Or at least make my day infinitely better.",
  "The way you care about people is one of the most beautiful things about you.",
  "I love our little inside jokes that nobody else would understand.",
  "You're proof that good things come to those who wait, and wow was the wait worth it.",
  "Every love song makes more sense since I met you.",
  "I want to be the reason you smile when you look at your phone.",
  "You are my favorite distraction and my most beautiful adventure."
]
